import type { Insight } from '../types/insight'

export const insights: Insight[] = [
    {
        id: '1',
        title: 'Тебе будуть зраджувати, допоки ти зраджуєш собі',
        keywords: ['Самоцінність',
            'Межі',
            'Стосунки'],
        description:
            `Ти можеш довго пояснювати чужу поведінку.
            Шукати причини, виправдання, правильні слова.
            Намагатися зрозуміти, чому з тобою вчинили саме так.
            Але є одна незручна правда: іноді люди починають поводитися з нами так,
            як ми вже поводимося із собою.
            Коли ти терпиш те, що ранить.
            Коли мовчиш там, де тобі боляче.
            Коли погоджуєшся на менше, ніж хочеш насправді.
            Світ дуже швидко зчитує межі, які ти сама стираєш.
            І справа не в тому, що ти “винна” у чужих вчинках.Ні.
            Люди відповідають за себе самі.
            Але якщо ти постійно відмовляєшся від власних почуттів,
            бажань і меж заради того, щоб тебе любили,
            не відкидали чи не засуджували — рано чи пізно ти починаєш втрачати себе.
            А разом із цим — і відчуття, що з тобою можна інакше.`,
        todo: `Коли наступного разу захочеш автоматично погодитися,
        щоб не створювати комусь незручностей, зроби паузу й запитай себе:
        “А чи не створюю я зараз незручність самій собі ?”`
    },
    {
        id: '2',
        title: 'Всьому свій час',
        keywords: ['Продуктивність', 'Цінність', 'Відпочинок'],
        description: `І це не плин за течією, в очікуванні, що твоє тебе знайде.
        Це той момент, поштовх, який запустить незворотний процес.
        Ти живеш довгий час з розумінням того, що щось не так, ти не на своєму місці.
        І вже давно пора все змінити. Та все ніяк: постійно відмовки, багато причин чому ні.
        Та обов'язково буде усвідомлення, що далі так не можна.
        І тоді ніякі перешкоди не завадять. Ти почнеш діяти, іти напролом, думаючи про власні бажання.
        Все, що заважало прийняти рішення відходить на задній план. Бо інакше вже не можна.
        Але головне відчути той момент, віддатися йому і ні про що не шкодувати. Бо попереду тільки краще.`,
        todo:
            `Напиши кілька слів про себе: чесно, відверто, без прикрас. І нехай це буде початком.`
    },
    {
        id: '3',
        title: 'А можна я зроблю по-своєму?',
        keywords: ['Вибір', 'Межі', 'Усвідомленість'],
        description: `Стільки різних поглядів на одну ситуацію.
        Стільки чужих думок, порад і “правильних” рішень.
        І в якийсь момент ти починаєш губитися
        між тим, як треба,
        і тим, чого хочеш насправді.
        Бо завжди знайдеться хтось,
        хто зробив би інакше.
        Обережніше. Правильніше. Зручніше.
        Але це чуже життя.
        І чужий шлях.
        Іноді найважче —
        дозволити собі зробити по-своєму.
        Навіть якщо хтось не зрозуміє.
        Навіть якщо помилишся.
        Бо тільки так можна почути себе.`,
        todo: `Запитай себе: “А як би я вчинила, якби слухала себе?”`
    },
    {
        id: '4',
        title: 'А матюкатись можна?',
        keywords: ['Свобода', 'Чесність', 'Емоції'],
        description: `Після десятків років виключно цензурної мови,
        я твердо знаю, що можна!

        Не стримуй себе у словах, проявах почуттів та вираженні емоцій.
        Чи доречно? Для кого доречно?
        Навіть не думай про те, що скажуть інші,
        тим паче, якщо ці люди тимчасові гості у твоєму житті.

        Прислухайся до себе і заяви про те, що давно хотіла!

        І я зараз не зовсім про матюки.`,
        todo: `Маленька дія:
        Скажи сьогодні щось чесно.
        "А як звучить мій справжній голос?"`
    },
    {
        id: '5',
        title: 'Перестань себе залякувати, просто спробуй',
        keywords: ['Страх', 'Зміни', 'Розвиток'],
        description: `Дуже часто ми лякаємо себе ще до того, як щось починаємо.
        Прокручуємо найгірші сценарії, сумніваємось у собі,
        чекаємо ідеального моменту чи гарантії, що все вийде.
        Але правда в тому, що більшість страхів існує тільки в нашій голові.

        Іноді достатньо не бути впевненою на сто відсотків.
        Достатньо просто спробувати.
        Без зайвого тиску.
        Без вимоги одразу бути ідеальною.

        Бо навіть якщо щось не вийде,
        це навряд чи буде неможливо виправити в майбутньому.

        Саме дія найчастіше дає відповіді
        на нескінченні роздуми.`,
        todo: `Маленька дія:
        Зроби сьогодні одну річ,
        яку давно відкладала через страх.`
    },
    {
        id: '6',
        title: 'Ти не мусиш проходити все сама',
        keywords: ['Підтримка', 'Довіра', 'Близькість'],
        description: `Ми зараз, по суті, на шляху трансформацій,
        пошуку нового для себе і відкриття прихованих потреб.

        Добре, якщо ти готова пройти все сама.
        Але також чудово, коли хтось поряд.

        Тут варто подумати про друга.

        Навряд їх багато, та й не треба цього.
        Але точно є той, хто підтримає найбожевільнішу ідею
        чи достукається до голосу розуму за потреби.

        Повір, я знаю, як важко довіряти і довіритися.

        Здається, що твої проблеми нікому не потрібні,
        крім тебе самої. Та це не так.

        Точно є людина, якій небайдужий твій стан.

        Зумій відкрити своє серце,
        відповісти на, здавалося б, звичайне повідомлення
        "Як ти?" не банальним "все добре", а відверто — так, як воно є.

        І хто знає, можливо, ти будеш не сама.
        І станеш для когось підтримкою.`,
        todo: `Маленька дія:
        Припиняй відповідати "все добре",
        якщо це не так.`
    },
    {
        id: '7',
        title: 'Важливо не втратити власні бажання серед чужих очікувань',
        keywords: ['Самоцінність', 'Вибір', 'Цінність'],
        description: `Нам постійно ставлять оцінки,
        встановлюють норми й підвищують планки.
        І це не завжди погано,
        якщо це мотивує тебе ставати кращою за власним бажанням.
        Тому що серед чужих очікувань
        дуже легко втратити смак життя.

        Почати жити не так, як хочеться тобі, а так, як "правильно",
        "успішно" чи "треба".
        Бо справжній кайф з'являється тоді,
        коли ти робиш щось не заради схвалення,
        а тому що тобі цього хочеться.

        Тобі подобається процес. Подобається результат.

        І вже не так важливо, чи отримав він найвищу оцінку
        і чи перевершив когось.
        Головне — що він твій.`,

        todo: `Маленька дія:
        Запитай себе: "А це справді те, чого хочу я?"`
    },
    {
        id: '8',
        title: 'Створи власну систему щастя',
        keywords: ['Усвідомленість', 'Відпочинок', 'Розвиток'],
        description: `Сьогодні прочитала про систему щастя,
        яка полягає у пошуку моментів, що радують протягом дня.

        Це може бути комплімент для когось, кава в улюбленій кав'ярні,
        тепла ванна чи будь-яка дрібничка, яка викликає посмішку.

        Як мало ми помічаємо такого.
        І ще менше робимо.
        Це прекрасна система, яка ніби оживляє, пробуджує бажання
        і дає необхідний заряд.

        Я хочу спробувати робити так щодня
        і кожен вечір починати із записів про те,
        що мене радувало протягом дня.

        Завтра я прокинусь трохи раніше,
        щоб нікуди не поспішати, не нервувати
        і мати хороший настрій.
        А ти?`,

        todo: `Маленька дія:
        Розроби власну систему щастя
        з трьох обов'язкових дій на щодень.`
    },
    {
        id: '9',
        title: 'Можливо, ідеальне життя вже існує',
        keywords: ['Усвідомленість', 'Цінність', 'Відпочинок'],
        description: `Інтернетом гуляє наратив про відсутність ідеального життя.
        І з цим важко не погодитись.
        
        Але що, як ідеальність не у недосяжній картинці,
        яку ми пів життя малюємо в уяві, а у моменті, коли всі справи зроблені
        і ти сидиш на кухні з горнятком кави...
        у тиші.
        
        Що, як ідеальність у сміху дітей,
        які граються у сусідній кімнаті
        (і тебе не чіпають)?

        У сонечку, яке світить зранку у вікно після нічної грози?
        У блискавці, яка розділяє небо під час дощу, а ти сидиш під дахом
        і насолоджуєшся цим страшенно прекрасним видом?

        То виходить, ідеальне життя існує.
        Просто не все так глобально,
        як нам здається.`,
        todo: `Маленька дія:

        Випий улюблений напій наодинці із собою.

        Злови свій ідеальний момент.`
    },
    {
        id: '10',
        title: 'Іноді варто довіритися інтуїції',
        keywords: ['Усвідомленість', 'Довіра', 'Розвиток'],
        description: `Іноді, просто довірившись інтуїції,
        можеш знайти книгу, яка потрібна тобі саме зараз.
        Уяви, ти просто береш книгу без жодної логіки.
        Не тому що вона популярна.
        Не тому що її хтось порадив.
        А тому що щось всередині ніби каже:
        "Візьми саме цю."
        І дуже дивно, як часто саме такі книги потрапляють у потрібний момент.
        Ти читаєш чужу історію і раптом знаходиш у ній стільки свого.
        Свої думки.
        Свої страхи.
        Або відповідь, яку давно не могла сформулювати.
        Можливо, справа навіть не в книгах.
        А в тому, що іноді варто трохи менше все контролювати
        і трохи більше прислухатися до себе.`,
        todo: `Маленька дія: 
        Спробуй вибрати книгу інтуїтивно.
        Можливо, за кілька днів ти знайдеш у ній важливу для себе відповідь.`
    },
    {
        id: '11',
        title: 'Не засуджуй. Не порівнюй. Просто будь',
        keywords: ['Чесність', 'Цінність', 'Емпатія'],
        description: `Не засуджуй. Не засуджуй... Не засуджуй!
        У кожного своя доля, свій шлях,який привів у точку, де ви зустрілись.
        І біль у всіх різний, але болить однаково сильно.

        Не порівнюй. Не порівнюй... Не порівнюй!
        Хоча так, усе пізнається у порівнянні.
        Та те, що в одних не викликає жодних почуттів,
        для інших стане каталізатором вибуху.
        
        Я не хочу, щоб мої страждання знецінювали,
        якими б мізерними вони не здавались.

        І я вчусь приймати переживання інших з максимальною емпатією.

        Хоч раніше, вперше знайомлячись з людиною,
        я бачила лише негативне в ній, зараз я намагаюсь знайти щось хороше.
        Але тут головне — без ідеалізації.

        Просто будь тим, ким ти є. І не заважай іншим бути тими,
        ким є вони.`,
        todo: `Маленька дія:
        Поміть сьогодні щось хороше у випадкових знайомих.`
    },

    {
        id: '12',
        title: 'Не все, що суперечить тобі, є неправильним',
        keywords: ['Усвідомленість', 'Емпатія', 'Розвиток'],
        description:
            `Іноді людина може сказати щось, що повністю суперечить твоїм думкам.
        І перша реакція — одразу сперечатися або відкидати це.
        Але якщо на хвилину зупинитись і просто послухати,
        можна побачити щось більше і навіть цікаве.
        
        Кожен дивиться на життя через власний досвід.
        Через свої помилки, пережиті ситуації й власні висновки.
        І це не означає, що хтось із вас правий чи неправий.
        Іноді чужа думка потрібна не для того, щоб ти з нею погодилась.
        А для того, щоб подивитися ширше.
        
        Бо саме так часто і розширюється горизонт — не коли всі думають однаково,
        а коли ти дозволяєш собі почути щось інше.`,
        todo: `Маленька дія:
        Коли почуєш думку, яка тебе зачепить або роздратує,
        не поспішай сперечатися.
        Запитай себе: "А що, якщо в цьому теж є частина правди?"`
    },
    {
        id: '13',
        title: 'Минуле тримає сильніше, ніж нам здається',
        keywords: ['Усвідомленість', 'Зміни', 'Свобода'],
        description: `Сьогодні я подумала про те, що більшість спорів, образ 
        і навіть війн крутяться навколо минулого.
        Навколо того, що колись сталося, хто був правий, хто винен,
        хто щось не пробачив або не зміг відпустити.
        
        І, можливо, якби люди вміли хоч трохи легше відпускати минуле,
        у світі було б менше болю.
        Бо минуле дуже часто продовжує жити всередині нас,
        таким маленьким черв'ячком.
        Керує рішеннями.
        Емоціями.
        Ставленням до людей.
        
        Іноді ми настільки тримаємось за старе,
        що перестаємо помічати теперішнє.
        Хоча життя давно йде далі.`,

        todo: `Маленька дія:
        Подумай: "За що з минулого я досі тримаюсь?"`
    },
    {
        id: '14',
        title: 'Час фільтрує важливе',
        keywords: ['Зміни', 'Довіра', 'Підтримка'],
        description: `Час лікує. Колись я вже роздумувала про це 
        і прийшла до висновку, що не лікує.
        Але час дуже гарно фільтрує людей у нашому житті.
        У його плині розчиняється все тимчасове, а отже і неважливе.

        Якщо здається, що зараз дуже погано, дай собі час.
        Стане легше.
        Спочатку буде боляче, тривожно і виходу не буде видно.
        Та кожен новий день наблизить до спокою, впевненості у майбутньому та у собі.

        Час перевіряє на міцність наші нерви,
        бо треба лиш трошки почекати, а це складно.
        Оточення проходить перевірку часом,
        бо не всі залишаться поруч.

        І лише те, що ми знайдемо, даючи собі трохи часу, — справді цінне.
        І тоді почнеться новий відлік.`,
        todo: `Маленька дія:

        Коли щось стається, кажи собі:
        "Якщо я не буду хвилюватись через це за місяць, 
        то і зараз не треба так сильно тривожитись."`
    },
    {
        id: '15',
        title: 'Відпускай людей, які вже не для тебе',
        keywords: ['Межі', 'Стосунки', 'Самоцінність'],
        description: `Треба менше жити чужими нормами, упередженнями й подвійними стандартами. 
        Перестати підлаштовуватись під очікування інших і картинку "як правильно".

        Бо дуже часто ми залишаємося там, де нам давно погано.
        Терпимо.
        Пояснюємо.
        Даємо ще один шанс.
        І переконуємо себе, що так і має бути.

        Хоча кризи у стосунках — це нормально.
        Люди змінюються, втомлюються, помиляються.
        І дуже цінно, коли двоє готові говорити,
        чути одне одного й разом працювати над стосунками.

        Але кохання — це не про те, щоб ставати зручним.
        Ти не функція.
        Не роль.
        Ти жива людина зі своїми почуттями,
        межами й бажанням бути щасливою.

        І якщо тобі постійно боляче, а ситуація не змінюється — можливо, час піти.
        Бо залишатися там, де тебе давно немає щасливої — теж самотність.`,

        todo: `Маленька дія:
        Запитай себе:
        "Чи людина поруч підсилює моє бажання жити й 
        бути щасливою — чи забирає навіть надію на це?"`
    },
    {
        id: '16',
        title: 'Не кожен заслуговує на твою чемність',
        keywords: ['Межі', 'Самоцінність', 'Чесність'],
        description: `Треба бути чемною, ввічливою. 
        Не відповідати агресією на агресію,
        проковтнути образи і посміхатись кривдникам у обличчя.

        Необхідно бути вищою за все, що зі швидкістю світла несеться на тебе з боку людей,
        які вирішили, що їхні слова хоч чогось варті.

        Але є люди, які розуміють лише ту мову, на якій самі говорять.
        Іноді достатньо одного чіткого слова, однієї впевненої відповіді
        або відмови терпіти те, що для тебе неприйнятно.

        І раптом виявляється, що безпідставних образ стає значно менше.
        
        Бути мудрішою — дуже класний скіл.
        Але вміти захищати себе теж важливо.
        Спокій, урівноваженість та адекватність — це не слабкість.

        І коли хтось сприймає це як дозвіл переходити всі межі,
        іноді варто нагадати, що в тебе ці межі є.`,

        todo: `Маленька дія:
        Не дозволяй нікому сприймати твоє мовчання у відповідь на образи за слабкість.
        "Вмаж йому" `
    },
    {
        id: '17',
        title: 'Якщо тебе так легко вивести з рівноваги, можливо, ти десь втратила її',
        keywords: ['Усвідомленість', 'Емоції', 'Відпочинок'],
        description: `Сьогодні син спитав мене: "Чого ти нервуєш?"
        І я задумалась — а справді, чого?
        Бо насправді я дуже люблю спокійний стан.
        Люблю, коли все рухається по плану.
        Коли немає зайвих відхилень, нічого не тисне, не дратує й не вибиває з себе.
        Але іноді хтось робить щось настільки нелогічне, неуважне чи безглузде,
        що це раптом сильно впливає на мій стан.
        І я нервую.
        Підвищую голос.
        Різко реагую.
        Наче злюсь не тільки на ситуацію,
        а ще й на те, що в мене забрали внутрішній спокій.
        
        А можливо, це не зовсім про спокій.
        Можливо, іноді це надмірний контроль, який ти плутаєш із ним.
        Бо життя — не готовий сценарій.
        І, мабуть, у цьому його краса.
        У несподіванках.
        У відхиленнях від плану.
        У живих емоціях.

        Можливо, не все потрібно контролювати.
        Іноді достатньо просто дозволити подіям відбуватись,
        а собі вчитись реагувати вже по ходу руху.
        Як за кермом.
        Ти не контролюєш всю дорогу наперед. Але все одно кермуєш.`,

        todo: `Маленька дія:
        Зверни увагу, що саме найчастіше вибиває тебе зі стану спокою.
        І наступного разу спробуй не контролювати це одразу.`
    },
    {
        id: '18',
        title: 'Не всі люди ставляться до тебе так, як ти до них',
        keywords: ['Довіра', 'Чесність', 'Стосунки'],
        description: `Нам постійно казали: "Як ти ставишся до людей, 
        так і вони ставитимуться до тебе". А насправді це не завжди працює.
        
        Якщо геть не впадати в розчарування, то варто визнати: люди різні.
        Але все ж більшість досить егоїстичні.
        Є ті, які одразу заявляють, що їм на все і всіх начхати,
        і вони робитимуть як краще для себе.
        Я таких людей поважаю.
        Вони не створюють ідеальну картинку.
        Ти завжди знаєш, чого від них очікувати — усе на поверхні.
        А є добрі, душевні, милі.
        Вони і підтримають, і поділяться, і пораду дадуть.
        Але як тільки десь треба буде йти по головах,
        твоя може виявитися першою сходинкою.
        
        І зрозуміло, що нам нічого не винні.
        Але просто здавалось, що тебе попередять.
        Що твої інтереси хоч трохи врахують. Та ні.
        Я боюсь таких людей.
        І не хочу мати їх у своєму оточенні.
        Ти розслабляєшся, довіряєш, а потім — раз, і ніж у спину.
        Звісно, всі різні. І ми вчиняємо так, як відчуваємо.
        І немає нічого поганого у власному добробуті.
        Але тоді не варто очікувати кращого у відповідь.`,
        todo: `Маленька дія:
        Просто будь відверта: із собою та з тим, хто тобі близький.`
    },
    {
        id: '19',
        title: 'Дай собі час дихати',
        keywords: ['Відпочинок', 'Підтримка', 'Усвідомленість'],
        description: `Я зараз знаходжусь у дивному періоді.
        Наче все стало тихо. І ніби багато речей втратили сенс.
        Можливо, це просто наслідки останніх пів року.
        Навчання, безсонні ночі, тривога, втрата звичних опор та родинних зв’язків.
        Постійне намагання триматись, бо поруч діти.

        І навіть зараз я не до кінця розумію, чи справді вже вийшла з того стану.
        Бо це не схоже на "все добре".
        Скоріше — це якась нова стадія.
        Коли після довгої гонки ти доходиш до проміжного етапу,
        де наче вже можна передохнути, але всередині все одно тисне потреба рухатись далі.

        І, можливо, зараз найважливіше — дати собі час насолодитись зупинкою
        і цією тишею всередині себе.
        Так, мені не подобається, що зараз ніби немає руху.
        Але водночас я розумію, що кілька тижнів — це дуже мало після всього, що було.
        І треба перестати так тиснути на себе.

        Все ж життя продовжується.
        Домашні справи.
        Готування.
        Маленькі челенджі кожного дня.
        Можливо, поки цього достатньо.
        І просто треба дати собі час видихнути після всього, через що пройшла.`,

        todo: `Маленька дія:
        Спробуй сьогодні не вимагати від себе великих результатів.
        А просто зроби декілька дрібних справ, які наблизять до тих великих цілей.`
    },

    {
        id: '20',
        title: 'А що, якщо це не моя стеля?',
        keywords: ['Зміни', 'Розвиток', 'Вибір'],
        description: `"Не зупиняйся на досягнутому!"
        Який же класний, мотивуючий вислів.
        А що, як у мене із досягнень три дипломи з відзнакою, двоє дітей і робота,
        яку я вже не так люблю і за яку мені болить кожен день?
        Як валіза без ручки: важко нести, шкода викинути.
        Чого я досягла?
        На чому не зупинятись?
        Як мені дивитись в очі тій амбітній 21-річній мені?

        Раб системи, який дає собі ще шість років і от тоді заживе як людина 😅
        А чи буде це?

        Я чесно не знаю.
        Я тільки знаю, що знову потрошку з’являється давно втрачене відчуття,
        що це не моя стеля, що я можу більше, що я не на своєму місці.
        Цікаво, чи втримаю його цього разу.
        Чи знову попрощаємось із ним на 15 років.
        Просто хочеться щось міняти, жити яскравіше,
        не рахувати дні до вихідного і кошти до зарплати.`,

        todo: `Маленька дія:
        Не зупиняйся на досягнутому.
        Я серйозно.
        Дай собі копняка під зад 😁`
    },
    {
        id: '21',
        title: 'Навчись прощати себе',
        keywords: ['Самоцінність', 'Чесність', 'Усвідомленість'],
        description: `Ми дуже часто чуємо: «Навчись прощати».
        І, можливо, в цьому справді щось є.
        Але останнім часом я все більше думаю про інше — про те,
        як важливо навчитись прощати себе.
        За помилки.
        За неправильні рішення.
        За людей не поруч.
        За втрачений час.
        За страхи.
        За те, що колись не знала того, що знаєш зараз.

        Мені здається, ми іноді буваємо до себе набагато жорстокішими,
        ніж до інших людей.
        Прокручуємо минуле.
        Звинувачуємо себе.
        Носимо всередині речі, які давно варто було відпустити.
        Хоча правда в тому, що ти не могла прожити деякі моменти по-іншому тією версією себе.
        І, можливо, прощення — це не завжди про інших людей.
        Іноді це про те, щоб перестати воювати із собою.`,

        todo: `Маленька дія:
        Подумай сьогодні: "За що я досі не можу пробачити себе?"`
    },

    {
        id: '22',
        title: 'Коли нам буде достатньо того, ким ми є?',
        keywords: ['Самоцінність', 'Цінність', 'Чесність'],
        description: `"Якщо я зараз це зроблю, мене похвалять!"
    "Я попрацюю до ночі і тоді мої старання оцінять."
    "Я зроблю за себе і за всіх, і от тоді точно виправдаю очікування."
    Звідки цей голос і чому він досі лунає в моїй голові?
    Чому я досі потребую визнання та уваги?
    Я цілком усвідомлюю, що я доросла, далеко не дурна.
    Я розумію, що досягла всього сама, хай якими б ті досягнення не були.
    Але мені досі треба, щоб мене хвалили.

    І водночас кожен схвальний відгук про мою роботу викликає недовіру.
    Я піддаю сумнівам визнання своїх досягнень.
    Бо не вірю, що так може бути.
    Це родом із дитинства чи звідки?
    Коли нам буде достатньо того, ким ми є,
    без змагань із собою та уявними перспективами?
    Ми цілісні.
    Ми самодостатні вже.
    Без загальноприйнятих норм досягнень.
    Бо хто їх взагалі придумує?
    Достатньо бути в моменті й отримувати від нього насолоду.
    Ніякі перемоги не подарують радість, якщо ми не приймемо свої поразки.`,

        todo: `Маленька дія:
    Похвали себе сьогодні.
    І візьми за звичку робити так кожного дня.`
    },

]

export default insights;
