import type { Insight } from '../types/insight'

export const insights: Insight[] = [
    {
        id: '1',
        title: 'Тебе будуть зраджувати, допоки ти зраджуєш собі',
        keywords: ['Самоцінність',
            'Межі',
            'Стосунки'],
        description:
            `Ти можеш довго пояснювати чужу поведінку.
            Шукати причини, виправдання, правильні слова.
            Намагатися зрозуміти, чому з тобою вчинили саме так.
            Але є одна незручна правда: іноді люди починають поводитися з нами так,
            як ми вже поводимося із собою.
            Коли ти терпиш те, що ранить.
            Коли мовчиш там, де тобі боляче.
            Коли погоджуєшся на менше, ніж хочеш насправді.
            Світ дуже швидко зчитує межі, які ти сама стираєш.
            І справа не в тому, що ти “винна” у чужих вчинках.Ні.
            Люди відповідають за себе самі.
            Але якщо ти постійно відмовляєшся від власних почуттів,
            бажань і меж заради того, щоб тебе любили,
            не відкидали чи не засуджували — рано чи пізно ти починаєш втрачати себе.
            А разом із цим — і відчуття, що з тобою можна інакше.`,
        todo: `Коли наступного разу захочеш автоматично погодитися,
        щоб не створювати комусь незручностей, зроби паузу й запитай себе:
        “А чи не створюю я зараз незручність самій собі ?”`
    },
    {
        id: '2',
        title: 'Всьому свій час',
        keywords: ['Продуктивність', 'Цінність', 'Відпочинок'],
        description:
            `І це не плин за течією, в очікуванні, що твоє тебе знайде.
            Це той момент, поштовх, який запустить незворотний процес.
            Ти живеш довгий час з розумінням того, що щось не так, ти не на своєму місці.
            І вже давно пора все змінити. Та все ніяк: постійно відмовки, багато причин чому ні.
            Та обов'язково буде усвідомлення, що далі так не можна.
            І тоді ніякі перешкоди не завадять. Ти почнеш діяти, іти напролом, думаючи про власні бажання.
            Все, що заважало прийняти рішення відходить на задній план. Бо інакше вже не можна.
            Але головне відчути той момент, віддатися йому і ні про що не шкодувати. Бо попереду тільки краще.`,
        todo:
            `Напиши кілька слів про себе: чесно, відверто, без прикрас. І нехай це буде початком.`
    },
    {
        id: '3',
        title: 'А можна я зроблю по-своєму?',
        keywords: ['Вибір', 'Межі', 'Усвідомленість'],
        description:
            `Стільки різних поглядів на одну ситуацію.
Стільки чужих думок, порад і “правильних” рішень.
І в якийсь момент ти починаєш губитися
між тим, як треба,
і тим, чого хочеш насправді.
Бо завжди знайдеться хтось,
хто зробив би інакше.
Обережніше. Правильніше. Зручніше.
Але це чуже життя.
І чужий шлях.
Іноді найважче —
дозволити собі зробити по-своєму.
Навіть якщо хтось не зрозуміє.
Навіть якщо помилишся.
Бо тільки так можна почути себе.`,
        todo:
            `Запитай себе: “А як би я вчинила, якби слухала себе?”`
    },
    {
        id: '4',
        title: 'А матюкатись можна?',
        keywords: ['Свобода', 'Чесність', 'Емоції'],
        description: `Після десятків років виключно цензурної мови,
я твердо знаю, що можна!

Не стримуй себе у словах, проявах почуттів
та вираженні емоцій.

Чи доречно? Для кого доречно?

Навіть не думай про те, що скажуть інші,
тим паче, якщо ці люди тимчасові гості у твоєму житті.

Прислухайся до себе
і заяви про те, що давно хотіла!

І я зараз не зовсім про матюки.`,
        todo: `Маленька дія:
Скажи сьогодні щось чесно.
"А як звучить мій справжній голос?"`
    },
    {
        id: '5',
        title: 'Перестань себе залякувати, просто спробуй',
        keywords: ['Страх', 'Зміни', 'Розвиток'],
        description: `Дуже часто ми лякаємо себе ще до того,
як щось починаємо.

Прокручуємо найгірші сценарії, сумніваємось у собі,
чекаємо ідеального моменту чи гарантії, що все вийде.

Але правда в тому, що більшість страхів існує тільки в нашій голові.

Іноді достатньо не бути впевненою на сто відсотків.
Достатньо просто спробувати.

Без зайвого тиску.
Без вимоги одразу бути ідеальною.

Бо навіть якщо щось не вийде,
це навряд чи буде неможливо виправити в майбутньому.

Саме дія найчастіше дає відповіді
на нескінченні роздуми.`,
        todo: `Маленька дія:

Зроби сьогодні одну річ,
яку давно відкладала через страх.`
    },
    {
        id: '6',
        title: 'Ти не мусиш проходити все сама',
        keywords: ['Підтримка', 'Довіра', 'Близькість'],
        description: `Ми зараз, по суті, на шляху трансформацій,
пошуку нового для себе і відкриття прихованих потреб.

Добре, якщо ти готова пройти все сама.
Але також чудово, коли хтось поряд.

Тут варто подумати про друга.

Навряд їх багато, та й не треба цього.
Але точно є той, хто підтримає найбожевільнішу ідею
чи достукається до голосу розуму за потреби.

Повір, я знаю, як важко довіряти і довіритися.

Здається, що твої проблеми нікому не потрібні,
крім тебе самої.

Та це не так.

Точно є людина,
якій небайдужий твій стан.

Зумій відкрити своє серце,
відповісти на, здавалося б, звичайне повідомлення
"Як ти?" не банальним "все добре",
а відверто — так, як воно є.

І хто знає,
можливо, ти будеш не сама.

І станеш для когось підтримкою.`,
        todo: `Маленька дія:

Припиняй відповідати "все добре",
якщо це не так.`
    },
    {
        id: '7',
        title: 'Важливо не втратити власні бажання серед чужих очікувань',
        keywords: ['Самоцінність', 'Вибір', 'Цінність'],
        description: `Нам постійно ставлять оцінки,
встановлюють норми й підвищують планки.

І це не завжди погано,
якщо це мотивує тебе ставати кращою за власним бажанням.

Тому що серед чужих очікувань
дуже легко втратити смак життя.

Почати жити не так, як хочеться тобі,
а так, як "правильно",
"успішно"
чи "треба".

Бо справжній кайф з'являється тоді,
коли ти робиш щось не заради схвалення,
а тому що тобі цього хочеться.

Тобі подобається процес.
Подобається результат.

І вже не так важливо,
чи отримав він найвищу оцінку
і чи перевершив когось.

Головне — що він твій.`,
        todo: `Маленька дія:

Запитай себе:

"А це справді те, чого хочу я?"`
    },
    {
        id: '8',
        title: 'Створи власну систему щастя',
        keywords: ['Усвідомленість', 'Відпочинок', 'Розвиток'],
        description: `Сьогодні прочитала про систему щастя,
яка полягає у пошуку моментів,
що радують протягом дня.

Це може бути комплімент для когось,
кава в улюбленій кав'ярні,
тепла ванна
чи будь-яка дрібничка,
яка викликає посмішку.

Як мало ми помічаємо такого.
І ще менше робимо.

Це прекрасна система,
яка ніби оживляє,
пробуджує бажання
і дає необхідний заряд.

Я хочу спробувати робити так щодня
і кожен вечір починати із записів про те,
що мене радувало протягом дня.

Завтра я прокинусь трохи раніше,
щоб нікуди не поспішати,
не нервувати
і мати хороший настрій.

А ти?`,
        todo: `Маленька дія:

Розроби власну систему щастя
з трьох обов'язкових дій на щодень.`
    },
    {
        id: '9',
        title: 'Можливо, ідеальне життя вже існує',
        keywords: ['Усвідомленість', 'Цінність', 'Відпочинок'],
        description: `Інтернетом гуляє наратив про відсутність ідеального життя.

І з цим важко не погодитись.

Але що, як ідеальність не у недосяжній картинці,
яку ми пів життя малюємо в уяві,
а у моменті, коли всі справи зроблені
і ти сидиш на кухні з горнятком кави...
у тиші.

Що, як ідеальність у сміху дітей,
які граються у сусідній кімнаті
(і тебе не чіпають)?

У сонечку, яке світить зранку у вікно
після нічної грози?

У блискавці, яка розділяє небо під час дощу,
а ти сидиш під дахом
і насолоджуєшся цим страшенно прекрасним видом?

То виходить,
ідеальне життя існує.

Просто не все так глобально,
як нам здається.`,
        todo: `Маленька дія:

Випий улюблений напій наодинці із собою.

Злови свій ідеальний момент.`
    },
    {
        id: '10',
        title: 'Іноді варто довіритися інтуїції',
        keywords: ['Усвідомленість', 'Довіра', 'Розвиток'],
        description: `Іноді, просто довірившись інтуїції,
можеш знайти книгу, яка потрібна тобі саме зараз.
Уяви, ти просто береш книгу без жодної логіки.
Не тому що вона популярна.
Не тому що її хтось порадив.
А тому що щось всередині ніби каже:
"Візьми саме цю."
І дуже дивно,
як часто саме такі книги
потрапляють у потрібний момент.
Ти читаєш чужу історію
і раптом знаходиш у ній стільки свого.
Свої думки.
Свої страхи.
Або відповідь,
яку давно не могла сформулювати.
Можливо, справа навіть не в книгах.
А в тому,
що іноді варто трохи менше все контролювати
і трохи більше прислухатися до себе.`,
        todo: `Маленька дія: 
        Спробуй вибрати книгу інтуїтивно.
        Можливо, за кілька днів ти знайдеш у ній важливу для себе відповідь.`
    },

]


export default insights;
